function translateToA(loc, cha) {
  return (
    "有種不真實的感覺，在" +
    loc +
    "旅程結束，當車子緩緩駛達台大，拉起手剎車的那一瞬間。有一種如釋重負的感覺，也有些難以言喻的體悟。雖然知道每次的結束並不是一個句點，而是新的開始，但卻總免不了一些感觸的引發，尤其是在這樣的日子裡頭，許多的片段在腦中反覆播送，好多好多的回憶出現在眼前，彷彿還才是昨天發生的事。" +
    "\r\n" +
    "\r\n" +
    "小時候總是以為，一定會有那麼樣的一個寶箱，打開寶箱，就埋藏著勇氣和力量；後來卻漸漸的發現，這個寶箱其實就在自己的身邊，是一起努力著的夥伴們，感謝一起經歷這次服務隊的你，因為" +
    cha +
    "你們，我才能變得勇敢。" +
    "\r\n" +
    "\r\n" +
    "因為希望能夠做的更好，我們向前奔跑，即便在嘗試的過程中總有挫折和困難，總會讓我們覺得跑的很喘，但是我們知道，遠端的那個目標，我們終將，趕上。這一切的一切，陪著我們，讓我們一年跑的比前一年更順利，讓我們有許多的榜樣可以做為參考，讓我們可以更加的有信心。"
  );
}

function translateToB(loc, cha) {
  return ("我曾經一廂情願的以為，改變"+loc+"當然自以為是，但始終自視外人就無所可為。最重要的是，關於"+loc+"及服務學習，要有什麼深刻想法，沒有持續參與，很難。許多問題得實際參與才有初步答案。而今我想法如此：有機會和"
				+cha+"建立關係，陪伴、協助予之更多人生選項和想像，這是他們的人生發展原本缺乏的應有權利，這也不等同指導或代為決定。"
				+"\r\n"+"\r\n"
				+"在服務學習中，我發現不同的自己，得到歡愉、組織經驗、團結情感和共同回憶。可"+loc+cha+"呢？服務學習用了多人的心血、時日和龐大金錢，本著善意，自覺行了「善事」或實踐「正義」，贏得許多掌聲──但質問自己時怎不自慚形穢？服務到底是"
				+loc+"服務到底是服務地點的還是自己的？自己又該如何自答？又該如何定位自己？"
				+"\r\n"+"\r\n"
				+"反省這次服務與過往有何不同──便知"+cha+"受諸多外在環境負面影響，踏入"+loc+"終與搖椅上的思考大相逕庭，因著那些思考以貼近心靈的方式具現眼前。與"+cha+"互動才進一步思索"+loc+"的過去、現況和未來。心頭的澎湃與難忘，好似漲潮漸漸捲上心頭，讓我無法停止思索"
				+loc+"。聽對心裡的聲音、面臨的困難和曾經的灰心無奈；聽"+cha+"聽對象道出自己的意志和行動正意圖回應外在條件並有所突破──數十年的一貫堅持，充盈懷鄉的情誼，如恆星堅持散發光熱，似雲朵飽蓄水氣穩定灑落銀色水珠灌溉地方。話語的微風輕輕敲響了幾個心底的音節，讓我深信服務學習唯有更深入參與才能收穫更多。"
				+"\r\n"+"\r\n"
				+"仍懷念那從"+loc+"回台大的路上見到光亮令世界如此不同。服務學習又為"+loc+"帶來如何的光亮？我希望爭相前往沒有光的地方，卻不是無自覺地在睡眠中飛翔；希望不是一道流星劃過，而能堅持散發光熱，就算是螢火蟲般的微光，終能頂住全世界的黑暗。")}

function translateToC(loc, cha) {
  return ("這學期服務學習課程中，我獲得最大的快樂與收穫在於，能夠親力親為的去幫助他人，不求任何回報也不論利益多寡，儘管只是付出微薄的心力，這都是服務學習中最有價值的意義。"
				+"\r\n"+"\r\n"
				+"在"+loc+"服務過程中，我看到了每位"+cha+"是那樣單純和快樂，並且也從他們身上看到與學到，學習絕對是一件快樂且再簡單不過的事。而在"+loc+"中，每次帶領這群"
				+cha +"，我都能感受到在"+loc+"服務的人們總是那樣耐心的陪伴每位"+cha+"，我學到的是必須要堅信只要能用心附出，絕對能幫助每位"+cha+"得到最大的幫助，當然這也絕對是我在"
				+loc+"學習中獲得最大的收穫。"
				+"\r\n"+"\r\n"
				+"因此我相信，服務學習應該用心去感受與體驗，從做中學，並從學習中自我檢討與實際體驗的精神。所以我更確信，服務學習應該落實於每個人的生活當中，我們更應該了解，唯有懂得附出，才能使教育獲得傑出與豐碩的果實。"
				)}
function translateToD(loc, cha) {
  return ("服務與學習究竟孰輕孰重，每個人在參與服務隊時，心中會有著不同裁量，故不在此評判之。然則就效益而論之，服務本身是否對" + cha+"有實質上之意義，往往是許多人爭論之重點所在。"+"\r\n"+"\r\n"
				+"對我而言，服務學習本身之重點即在於學習，在某些方面而言，服務是學習上包覆之彩衣，藉此成長而逐漸茁壯，學習過程的經歷。同樣地，當我們對" +loc+"提供服務時，我們習得了如何設身處地以" +loc+"需求設計服務，亦藉此了解了" +loc+"所遭遇之問題與困境。假若有朝一日，我們成為了社會的中堅分子，如果我們還能記得"
				+loc+"所遇見之問題，還能保持那份在大學時期被點燃之熱情，並為原鄉盡一份心力，學習本身對當地的效益不言自明。 "+"\r\n"+"\r\n"+
	        "而就服務言之，我們都對於服務有極高的期待，認為只要出了服務隊，我們就可以為當地付出，進而改善當地現狀。然則我們卻忘了，服務本身的效果永遠不是一蹴可及，其往往需要多方團體努力，經由長時間之付出與培力，最終才能使當地能有自主營造與永續經營之能力。"
				+"\r\n"+"\r\n"+
	        "總言之，服務制度與現況永遠不是否定服務效益之理由。有了熱情，就會有想要改善現況之動力，並進一步省思現有之服務，並設計出能發揮更多效益之服務方案。而藉由服務與學習之迴圈不斷的反饋，"
	        + "期許學生將會在此過程中找到熱情，這就是服務學習課程之目的，亦是未來可能身為社會砥柱，甚至可能掌握社會資源分配之台大人，所應有之經歷。"
				+"\r\n"+"\r\n"
	        +"我們的服務成果的效益究竟能有多少，就有賴於我們努力發揮才智，學習以" +cha+"之視野出發，設計出符合" +cha+"需求之服務模式，並在過程中發掘熱情並努力執行之了。"
		)}



$(".buttonOne").click(function () {
  var inputloc = $("#input1").val();
  var inputcha = $("#input2").val();
  $("#output").val(translateToA(inputloc, inputcha));
});

$(".buttonTwo").click(function () {
  var inputloc = $("#input1").val();
  var inputcha = $("#input2").val();
  $("#output").val(translateToB(inputloc, inputcha));
});

$(".buttonThree").click(function () {
  var inputloc = $("#input1").val();
  var inputcha = $("#input2").val();
  $("#output").val(translateToC(inputloc, inputcha));
});

$(".buttonFour").click(function () {
  var inputloc = $("#input1").val();
  var inputcha = $("#input2").val();
  $("#output").val(translateToD(inputloc, inputcha));
});

$(".E").click(function () {
  var copyText = $("#output").val();
  copyText.select();
  document.execCommand("Copy");
  alert("Copied the text: " + copyText.value);
});
